test/cassettes/shipments/refund.yml


-
    request:
        method: POST
        url: 'https://api.easypost.com/v2/shipments'
        headers:
            Host: api.easypost.com
            Accept: application/json
            Authorization: ''
            Content-Type: application/json
            User-Agent: ''
            X-Client-User-Agent: ''
            EasyPost-Version: '2'
        body: '{"shipment":{"to_address":{"name":"Jack Sparrow","company":"EasyPost","street1":"388 Townsend St","street2":"Apt 20","city":"San Francisco","state":"CA","zip":"94107","phone":"5555555555"},"from_address":{"name":"Jack Sparrow","company":"EasyPost","street1":"388 Townsend St","street2":"Apt 20","city":"San Francisco","state":"CA","zip":"94107","phone":"5555555555"},"parcel":{"length":"10","width":"8","height":"4","weight":"15.4"},"service":"First","carrier_accounts":["ca_8dc116debcdb49b5a66a2ddee4612600"]}}'
    response:
        status:
            http_version: '2'
            code: '201'
            message: ''
        headers:
            x-frame-options: SAMEORIGIN
            x-xss-protection: '1; mode=block'
            x-content-type-options: nosniff
            x-download-options: noopen
            x-permitted-cross-domain-policies: none
            referrer-policy: strict-origin-when-cross-origin
            x-ep-request-uuid: 80dc0e2361fdc3c6e79a762700403470
            cache-control: 'no-cache, no-store'
            pragma: no-cache
            expires: '0'
            location: /api/v2/shipments/shp_62bbbff53e384652b344e12e6b952e3a
            content-type: 'application/json; charset=utf-8'
            content-length: '6919'
            etag: 'W/"5613f8c50710ef3301db3c33cbe727c9"'
            x-request-id: 36ce5c71-a4b7-4e09-9076-d32ad082fd65
            x-runtime: '1.286659'
            x-node: bigweb1nuq
            x-version-label: easypost-202202042220-76f9648007-master
            x-backend: easypost
            x-proxied: ['intlb1nuq 88c34981dc', 'extlb2nuq 88c34981dc']
            strict-transport-security: 'max-age=31536000; includeSubDomains; preload'
        body: '{"created_at":"2022-02-05T00:24:38Z","is_return":false,"messages":[],"mode":"test","options":{"currency":"USD","payment":{"type":"SENDER"},"date_advance":0},"reference":null,"status":"unknown","tracking_code":"9400100895232105611980","updated_at":"2022-02-05T00:24:39Z","batch_id":null,"batch_status":null,"batch_message":null,"customs_info":null,"from_address":{"id":"adr_012bd861861a11ec8e20ac1f6b0a0d1e","object":"Address","created_at":"2022-02-05T00:24:38+00:00","updated_at":"2022-02-05T00:24:38+00:00","name":"Jack Sparrow","company":"EasyPost","street1":"388 Townsend St","street2":"Apt 20","city":"San Francisco","state":"CA","zip":"94107","country":"US","phone":"5555555555","email":null,"mode":"test","carrier_facility":null,"residential":null,"federal_tax_id":null,"state_tax_id":null,"verifications":{}},"insurance":"50.00","order_id":null,"parcel":{"id":"prcl_c6c26c730cbe42a6b746b55864f2ff41","object":"Parcel","created_at":"2022-02-05T00:24:38Z","updated_at":"2022-02-05T00:24:38Z","length":10.0,"width":8.0,"height":4.0,"predefined_package":null,"weight":15.4,"mode":"test"},"postage_label":{"object":"PostageLabel","id":"pl_49b149dc898b4aaa87f48ce1861bea5b","created_at":"2022-02-05T00:24:39Z","updated_at":"2022-02-05T00:24:39Z","date_advance":0,"integrated_form":"none","label_date":"2022-02-05T00:24:39Z","label_resolution":300,"label_size":"4x6","label_type":"default","label_file_type":"image/png","label_url":"https://easypost-files.s3.us-west-2.amazonaws.com/files/postage_label/20220205/f056e1348369471baaef7356b06595f0.png","label_pdf_url":null,"label_zpl_url":null,"label_epl2_url":null,"label_file":null},"rates":[{"id":"rate_3a66fdcaa49e41cb971f4702c7ed67e5","object":"Rate","created_at":"2022-02-05T00:24:38Z","updated_at":"2022-02-05T00:24:38Z","mode":"test","service":"Priority","carrier":"USPS","rate":"7.37","currency":"USD","retail_rate":"8.70","retail_currency":"USD","list_rate":"7.37","list_currency":"USD","delivery_days":1,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":1,"shipment_id":"shp_62bbbff53e384652b344e12e6b952e3a","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},{"id":"rate_f4b82a0387be4e0ca32a3ed828aaac51","object":"Rate","created_at":"2022-02-05T00:24:38Z","updated_at":"2022-02-05T00:24:38Z","mode":"test","service":"First","carrier":"USPS","rate":"5.49","currency":"USD","retail_rate":"5.49","retail_currency":"USD","list_rate":"5.49","list_currency":"USD","delivery_days":2,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":2,"shipment_id":"shp_62bbbff53e384652b344e12e6b952e3a","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},{"id":"rate_dfc75566409048b7ae3f0a319e4c5260","object":"Rate","created_at":"2022-02-05T00:24:38Z","updated_at":"2022-02-05T00:24:38Z","mode":"test","service":"ParcelSelect","carrier":"USPS","rate":"7.22","currency":"USD","retail_rate":"7.22","retail_currency":"USD","list_rate":"7.22","list_currency":"USD","delivery_days":2,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":2,"shipment_id":"shp_62bbbff53e384652b344e12e6b952e3a","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},{"id":"rate_70db1439f1be49aaadeb157b9bd615f1","object":"Rate","created_at":"2022-02-05T00:24:38Z","updated_at":"2022-02-05T00:24:38Z","mode":"test","service":"Express","carrier":"USPS","rate":"23.75","currency":"USD","retail_rate":"27.40","retail_currency":"USD","list_rate":"23.75","list_currency":"USD","delivery_days":null,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":null,"shipment_id":"shp_62bbbff53e384652b344e12e6b952e3a","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"}],"refund_status":null,"scan_form":null,"selected_rate":{"id":"rate_f4b82a0387be4e0ca32a3ed828aaac51","object":"Rate","created_at":"2022-02-05T00:24:39Z","updated_at":"2022-02-05T00:24:39Z","mode":"test","service":"First","carrier":"USPS","rate":"5.49","currency":"USD","retail_rate":"5.49","retail_currency":"USD","list_rate":"5.49","list_currency":"USD","delivery_days":2,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":2,"shipment_id":"shp_62bbbff53e384652b344e12e6b952e3a","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},"tracker":{"id":"trk_b0e2d9907965424ba77b2c4357f105a5","object":"Tracker","mode":"test","tracking_code":"9400100895232105611980","status":"unknown","status_detail":"unknown","created_at":"2022-02-05T00:24:40Z","updated_at":"2022-02-05T00:24:40Z","signed_by":null,"weight":null,"est_delivery_date":null,"shipment_id":"shp_62bbbff53e384652b344e12e6b952e3a","carrier":"USPS","tracking_details":[],"fees":[],"carrier_detail":null,"public_url":"https://track.easypost.com/djE6dHJrX2IwZTJkOTkwNzk2NTQyNGJhNzdiMmM0MzU3ZjEwNWE1"},"to_address":{"id":"adr_012a29d8861a11eca980ac1f6bc7b362","object":"Address","created_at":"2022-02-05T00:24:38+00:00","updated_at":"2022-02-05T00:24:39+00:00","name":"JACK SPARROW","company":"EASYPOST","street1":"388 TOWNSEND ST APT 20","street2":null,"city":"SAN FRANCISCO","state":"CA","zip":"94107-1670","country":"US","phone":"5555555555","email":null,"mode":"test","carrier_facility":null,"residential":true,"federal_tax_id":null,"state_tax_id":null,"verifications":{"zip4":{"success":true,"errors":[],"details":null},"delivery":{"success":true,"errors":[],"details":{"latitude":37.77551,"longitude":-122.39697,"time_zone":"America/Los_Angeles"}}}},"usps_zone":1,"return_address":{"id":"adr_012bd861861a11ec8e20ac1f6b0a0d1e","object":"Address","created_at":"2022-02-05T00:24:38+00:00","updated_at":"2022-02-05T00:24:38+00:00","name":"Jack Sparrow","company":"EasyPost","street1":"388 Townsend St","street2":"Apt 20","city":"San Francisco","state":"CA","zip":"94107","country":"US","phone":"5555555555","email":null,"mode":"test","carrier_facility":null,"residential":null,"federal_tax_id":null,"state_tax_id":null,"verifications":{}},"buyer_address":{"id":"adr_012a29d8861a11eca980ac1f6bc7b362","object":"Address","created_at":"2022-02-05T00:24:38+00:00","updated_at":"2022-02-05T00:24:39+00:00","name":"JACK SPARROW","company":"EASYPOST","street1":"388 TOWNSEND ST APT 20","street2":null,"city":"SAN FRANCISCO","state":"CA","zip":"94107-1670","country":"US","phone":"5555555555","email":null,"mode":"test","carrier_facility":null,"residential":true,"federal_tax_id":null,"state_tax_id":null,"verifications":{"zip4":{"success":true,"errors":[],"details":null},"delivery":{"success":true,"errors":[],"details":{"latitude":37.77551,"longitude":-122.39697,"time_zone":"America/Los_Angeles"}}}},"forms":[],"fees":[{"object":"Fee","type":"LabelFee","amount":"0.00000","charged":true,"refunded":false},{"object":"Fee","type":"PostageFee","amount":"5.49000","charged":true,"refunded":false},{"object":"Fee","type":"InsuranceFee","amount":"0.25000","charged":true,"refunded":false}],"id":"shp_62bbbff53e384652b344e12e6b952e3a","object":"Shipment"}'
        curl_info:
            url: 'https://api.easypost.com/v2/shipments'
            content_type: 'application/json; charset=utf-8'
            http_code: 201
            header_size: 837
            request_size: 556
            filetime: -1
            ssl_verify_result: 0
            redirect_count: 0
            total_time: 1.474475
            namelookup_time: 0.001066
            connect_time: 0.056895
            pretransfer_time: 0.128719
            size_upload: 511.0
            size_download: 6919.0
            speed_download: 4692.0
            speed_upload: 346.0
            download_content_length: 6919.0
            upload_content_length: 511.0
            starttransfer_time: 0.128737
            redirect_time: 0.0
            redirect_url: ''
            primary_ip: 169.62.110.130
            certinfo: {  }
            primary_port: 443
            local_ip: 10.130.6.7
            local_port: 63557
            http_version: 3
            protocol: 2
            ssl_verifyresult: 0
            scheme: HTTPS
            appconnect_time_us: 128553
            connect_time_us: 56895
            namelookup_time_us: 1066
            pretransfer_time_us: 128719
            redirect_time_us: 0
            starttransfer_time_us: 128737
            total_time_us: 1474475
-
    request:
        method: GET
        url: 'https://api.easypost.com/v2/shipments/shp_62bbbff53e384652b344e12e6b952e3a/refund'
        headers:
            Host: api.easypost.com
            Accept: application/json
            Authorization: ''
            Content-Type: application/json
            User-Agent: ''
            X-Client-User-Agent: ''
            EasyPost-Version: '2'
    response:
        status:
            http_version: '2'
            code: '200'
            message: ''
        headers:
            x-frame-options: SAMEORIGIN
            x-xss-protection: '1; mode=block'
            x-content-type-options: nosniff
            x-download-options: noopen
            x-permitted-cross-domain-policies: none
            referrer-policy: strict-origin-when-cross-origin
            x-ep-request-uuid: 80dc0e2361fdc3c8e79a7628004034bb
            cache-control: 'no-cache, no-store'
            pragma: no-cache
            expires: '0'
            content-type: 'application/json; charset=utf-8'
            content-length: '8060'
            etag: 'W/"76096b7e9842363601b19bd3865e59f1"'
            x-request-id: 4b356b1a-210a-4e93-b6e0-464df353e788
            x-runtime: '0.156817'
            x-node: bigweb2nuq
            x-version-label: easypost-202202042220-76f9648007-master
            x-backend: easypost
            x-proxied: ['intlb2nuq 88c34981dc', 'extlb2nuq 88c34981dc']
            strict-transport-security: 'max-age=31536000; includeSubDomains; preload'
        body: '{"created_at":"2022-02-05T00:24:38Z","is_return":false,"messages":[],"mode":"test","options":{"currency":"USD","payment":{"type":"SENDER"},"date_advance":0},"reference":null,"status":"unknown","tracking_code":"9400100895232105611980","updated_at":"2022-02-05T00:24:40Z","batch_id":null,"batch_status":null,"batch_message":null,"customs_info":null,"from_address":{"id":"adr_012bd861861a11ec8e20ac1f6b0a0d1e","object":"Address","created_at":"2022-02-05T00:24:38+00:00","updated_at":"2022-02-05T00:24:38+00:00","name":"Jack Sparrow","company":"EasyPost","street1":"388 Townsend St","street2":"Apt 20","city":"San Francisco","state":"CA","zip":"94107","country":"US","phone":"5555555555","email":null,"mode":"test","carrier_facility":null,"residential":null,"federal_tax_id":null,"state_tax_id":null,"verifications":{}},"insurance":"50.00","order_id":null,"parcel":{"id":"prcl_c6c26c730cbe42a6b746b55864f2ff41","object":"Parcel","created_at":"2022-02-05T00:24:38Z","updated_at":"2022-02-05T00:24:38Z","length":10.0,"width":8.0,"height":4.0,"predefined_package":null,"weight":15.4,"mode":"test"},"postage_label":{"object":"PostageLabel","id":"pl_49b149dc898b4aaa87f48ce1861bea5b","created_at":"2022-02-05T00:24:39Z","updated_at":"2022-02-05T00:24:39Z","date_advance":0,"integrated_form":"none","label_date":"2022-02-05T00:24:39Z","label_resolution":300,"label_size":"4x6","label_type":"default","label_file_type":"image/png","label_url":"https://easypost-files.s3.us-west-2.amazonaws.com/files/postage_label/20220205/f056e1348369471baaef7356b06595f0.png","label_pdf_url":null,"label_zpl_url":null,"label_epl2_url":null,"label_file":null},"rates":[{"id":"rate_3a66fdcaa49e41cb971f4702c7ed67e5","object":"Rate","created_at":"2022-02-05T00:24:38Z","updated_at":"2022-02-05T00:24:38Z","mode":"test","service":"Priority","carrier":"USPS","rate":"7.37","currency":"USD","retail_rate":"8.70","retail_currency":"USD","list_rate":"7.37","list_currency":"USD","delivery_days":1,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":1,"shipment_id":"shp_62bbbff53e384652b344e12e6b952e3a","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},{"id":"rate_f4b82a0387be4e0ca32a3ed828aaac51","object":"Rate","created_at":"2022-02-05T00:24:38Z","updated_at":"2022-02-05T00:24:38Z","mode":"test","service":"First","carrier":"USPS","rate":"5.49","currency":"USD","retail_rate":"5.49","retail_currency":"USD","list_rate":"5.49","list_currency":"USD","delivery_days":2,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":2,"shipment_id":"shp_62bbbff53e384652b344e12e6b952e3a","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},{"id":"rate_dfc75566409048b7ae3f0a319e4c5260","object":"Rate","created_at":"2022-02-05T00:24:38Z","updated_at":"2022-02-05T00:24:38Z","mode":"test","service":"ParcelSelect","carrier":"USPS","rate":"7.22","currency":"USD","retail_rate":"7.22","retail_currency":"USD","list_rate":"7.22","list_currency":"USD","delivery_days":2,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":2,"shipment_id":"shp_62bbbff53e384652b344e12e6b952e3a","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},{"id":"rate_70db1439f1be49aaadeb157b9bd615f1","object":"Rate","created_at":"2022-02-05T00:24:38Z","updated_at":"2022-02-05T00:24:38Z","mode":"test","service":"Express","carrier":"USPS","rate":"23.75","currency":"USD","retail_rate":"27.40","retail_currency":"USD","list_rate":"23.75","list_currency":"USD","delivery_days":null,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":null,"shipment_id":"shp_62bbbff53e384652b344e12e6b952e3a","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"}],"refund_status":"submitted","scan_form":null,"selected_rate":{"id":"rate_f4b82a0387be4e0ca32a3ed828aaac51","object":"Rate","created_at":"2022-02-05T00:24:39Z","updated_at":"2022-02-05T00:24:39Z","mode":"test","service":"First","carrier":"USPS","rate":"5.49","currency":"USD","retail_rate":"5.49","retail_currency":"USD","list_rate":"5.49","list_currency":"USD","delivery_days":2,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":2,"shipment_id":"shp_62bbbff53e384652b344e12e6b952e3a","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},"tracker":{"id":"trk_b0e2d9907965424ba77b2c4357f105a5","object":"Tracker","mode":"test","tracking_code":"9400100895232105611980","status":"pre_transit","status_detail":"status_update","created_at":"2022-02-05T00:24:40Z","updated_at":"2022-02-05T00:24:40Z","signed_by":null,"weight":null,"est_delivery_date":"2022-02-05T00:24:40Z","shipment_id":"shp_62bbbff53e384652b344e12e6b952e3a","carrier":"USPS","tracking_details":[{"object":"TrackingDetail","message":"Pre-Shipment Info Sent to USPS","description":null,"status":"pre_transit","status_detail":"status_update","datetime":"2022-01-05T00:24:40Z","source":"USPS","carrier_code":null,"tracking_location":{"object":"TrackingLocation","city":null,"state":null,"country":null,"zip":null}},{"object":"TrackingDetail","message":"Shipping Label Created","description":null,"status":"pre_transit","status_detail":"status_update","datetime":"2022-01-05T13:01:40Z","source":"USPS","carrier_code":null,"tracking_location":{"object":"TrackingLocation","city":"HOUSTON","state":"TX","country":null,"zip":"77063"}}],"fees":[],"carrier_detail":{"object":"CarrierDetail","service":"First-Class Package Service","container_type":null,"est_delivery_date_local":null,"est_delivery_time_local":null,"origin_location":"HOUSTON TX, 77001","origin_tracking_location":{"object":"TrackingLocation","city":"HOUSTON","state":"TX","country":null,"zip":"77063"},"destination_location":"CHARLESTON SC, 29401","destination_tracking_location":null,"guaranteed_delivery_date":null,"alternate_identifier":null,"initial_delivery_attempt":null},"public_url":"https://track.easypost.com/djE6dHJrX2IwZTJkOTkwNzk2NTQyNGJhNzdiMmM0MzU3ZjEwNWE1"},"to_address":{"id":"adr_012a29d8861a11eca980ac1f6bc7b362","object":"Address","created_at":"2022-02-05T00:24:38+00:00","updated_at":"2022-02-05T00:24:39+00:00","name":"JACK SPARROW","company":"EASYPOST","street1":"388 TOWNSEND ST APT 20","street2":null,"city":"SAN FRANCISCO","state":"CA","zip":"94107-1670","country":"US","phone":"5555555555","email":null,"mode":"test","carrier_facility":null,"residential":true,"federal_tax_id":null,"state_tax_id":null,"verifications":{"zip4":{"success":true,"errors":[],"details":null},"delivery":{"success":true,"errors":[],"details":{"latitude":37.77551,"longitude":-122.39697,"time_zone":"America/Los_Angeles"}}}},"usps_zone":1,"return_address":{"id":"adr_012bd861861a11ec8e20ac1f6b0a0d1e","object":"Address","created_at":"2022-02-05T00:24:38+00:00","updated_at":"2022-02-05T00:24:38+00:00","name":"Jack Sparrow","company":"EasyPost","street1":"388 Townsend St","street2":"Apt 20","city":"San Francisco","state":"CA","zip":"94107","country":"US","phone":"5555555555","email":null,"mode":"test","carrier_facility":null,"residential":null,"federal_tax_id":null,"state_tax_id":null,"verifications":{}},"buyer_address":{"id":"adr_012a29d8861a11eca980ac1f6bc7b362","object":"Address","created_at":"2022-02-05T00:24:38+00:00","updated_at":"2022-02-05T00:24:39+00:00","name":"JACK SPARROW","company":"EASYPOST","street1":"388 TOWNSEND ST APT 20","street2":null,"city":"SAN FRANCISCO","state":"CA","zip":"94107-1670","country":"US","phone":"5555555555","email":null,"mode":"test","carrier_facility":null,"residential":true,"federal_tax_id":null,"state_tax_id":null,"verifications":{"zip4":{"success":true,"errors":[],"details":null},"delivery":{"success":true,"errors":[],"details":{"latitude":37.77551,"longitude":-122.39697,"time_zone":"America/Los_Angeles"}}}},"forms":[],"fees":[{"object":"Fee","type":"LabelFee","amount":"0.00000","charged":true,"refunded":false},{"object":"Fee","type":"PostageFee","amount":"5.49000","charged":true,"refunded":false},{"object":"Fee","type":"InsuranceFee","amount":"0.25000","charged":true,"refunded":false}],"id":"shp_62bbbff53e384652b344e12e6b952e3a","object":"Shipment"}'
        curl_info:
            url: 'https://api.easypost.com/v2/shipments/shp_62bbbff53e384652b344e12e6b952e3a/refund'
            content_type: 'application/json; charset=utf-8'
            http_code: 200
            header_size: 771
            request_size: 578
            filetime: -1
            ssl_verify_result: 0
            redirect_count: 0
            total_time: 0.357114
            namelookup_time: 0.001321
            connect_time: 0.058508
            pretransfer_time: 0.141053
            size_upload: 0.0
            size_download: 8060.0
            speed_download: 22569.0
            speed_upload: 0.0
            download_content_length: 8060.0
            upload_content_length: 0.0
            starttransfer_time: 0.357079
            redirect_time: 0.0
            redirect_url: ''
            primary_ip: 169.62.110.130
            certinfo: {  }
            primary_port: 443
            local_ip: 10.130.6.7
            local_port: 63558
            http_version: 3
            protocol: 2
            ssl_verifyresult: 0
            scheme: HTTPS
            appconnect_time_us: 140839
            connect_time_us: 58508
            namelookup_time_us: 1321
            pretransfer_time_us: 141053
            redirect_time_us: 0
            starttransfer_time_us: 357079
            total_time_us: 357114
